#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete's Py-roject
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil @:t ::t ^:{} _:{} *:t pri:t
#+TOC: headlines 2
#+PROPERTY:header-args :eval never-export
#+CATEGORY: Primal
#+TODO: RAW INIT TODO ACTIVE | DONE

* TODO [#A] Sample Pythonic Module as a Project
SCHEDULED: <2023-10-31 Tue>
:LOGBOOK:
CLOCK: [2023-10-31 Tue 13:56]--[2023-10-31 Tue 14:01] =>  0:05
CLOCK: [2023-10-31 Tue 13:49]--[2023-10-31 Tue 13:51] =>  0:02
CLOCK: [2023-10-25 Wed 09:55]--[2023-10-25 Wed 10:24] =>  0:29
CLOCK: [2023-10-24 Tue 09:03]--[2023-10-24 Tue 09:20] =>  0:17
CLOCK: [2023-10-20 Fri 09:53]--[2023-10-20 Fri 10:05] =>  0:12
CLOCK: [2023-10-20 Fri 09:16]--[2023-10-20 Fri 09:39] =>  0:23
:END:
Hosted at GitHub as a *detached* Repository

More about [[https://docs.python-guide.org/writing/structure/][structure]]

#+begin_src sh :results output :exports both
  tree -I '*.pyc|*.*#|*.org~|__pycache__' 2>&1
#+end_src

#+RESULTS:
#+begin_example
.
├── docs
│   ├── conf.py
│   ├── index.rst
│   ├── make.bat
│   └── Makefile
├── LICENSE
├── Makefile
├── MANIFEST.in
├── README.org
├── requirements.txt
├── sample
│   ├── core.py
│   ├── helpers.py
│   └── __init__.py
├── setup.py
└── tests
    ├── context.py
    ├── __init__.py
    ├── test_advanced.py
    └── test_basic.py

3 directories, 17 files
#+end_example

** This simple project is an template
for all following further Python projects

*** E.g. it is a mould
and all projects will derive out from there

* If you want to learn more about ~setup.py~ files
check out [[https://github.com/kennethreitz/setup.py][this]] repository.

* License issue rectification
SCHEDULED: <2023-11-02 Thu>
[[file:LICENSE::Copyright (c) 2023, Anton S. Kosinov][Link]]
